from openai import AsyncOpenAI
from app.core.config import settings


class AIService:
    def __init__(self) -> None:
        self.client = AsyncOpenAI(
            api_key=settings.GROQ_API_KEY,
            base_url="https://api.groq.com/openai/v1",
        )
        self.model = settings.AI_MODEL

    async def diff_versions(self, diff_text: str) -> str:
        prompt = f"""Ниже приведены изменения между двумя версиями документа в формате diff:
        - Строки со знаком '-' были удалены или изменены в предыдущей версии.
        - Строки со знаком '+' добавлены в текущей версии.

        Проведи смысловой и правовой аудит этих правок по следующему плану:

        1. Краткое резюме:
        Сформулируй ключевую суть произошедших изменений в 2-3 емких предложениях.

        2. Попунктный разбор:
        Сопоставь удаленные (-) и добавленные (+) фрагменты. Четко укажи, что конкретно изменилось по смыслу для каждого пункта.

        3. Оценка рисков и последствий:
        Выдели критические сдвиги условий: дедлайны, финансовые обязательства, штрафные санкции, распределение ответственности сторон или появление односторонних прав.

        --- СПИСОК ИЗМЕНЕНИЙ ---
        {diff_text}
        """
        response = await self.client.chat.completions.create(
            model=settings.AI_MODEL,
            messages=[
                {
                    "role": "system",
                    "content": "Ты — ведущий юрисконсульт и эксперт"
                    "по аудиту договорной документации."
                    "Твоя задача — проводить строгий смысловой анализ"
                    "изменений в текстах документов на русском языке."
                    "Опирайся исключительно на предоставленные факты,"
                    "избегай домыслов и формулируй выводы лаконично,"
                    "точно и профессионально."
                    "Выделяй только факты и суть изменений"
                    "четко и структурированно на русском языке.",
                },
                {"role": "user", "content": prompt},
            ],
            temperature=0.1,
        )
        return response.choices[0].message.content


ai_service = AIService()
